In [1]:
import pandas as pd
import numpy as np

In [5]:
"""
    numpy.concatenate()
"""

x = [1,2,3]
y = [4,5,6]
z = [7,8,9]

np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [8]:
"""
    pandas.concat()
"""

ser1 = pd.Series(['A', 'B', 'C'], index=[1,2,3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4,5,6])
print(ser1)
print(ser2)

pd.concat([ser1, ser2])

1    A
2    B
3    C
dtype: object
4    D
5    E
6    F
dtype: object

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [22]:
# make_df(): create a DataFrame object
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

print(make_df('ABC', [1, 2]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [39]:
# Concatenate the two DataFrame objects
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

print(df1)
print(df2)

pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [48]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])

print(df3)
print(df4)

pd.concat([df3, df4], axis=1)

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [51]:
"""
    concate() Features
"""

# Case 1: Duplicate indices
x = make_df('AB', [0,1])
y = make_df('AB', [0,1])

print(x); print(y)

pd.concat([x,y])

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A0  B0
1  A1  B1

    A   B
0  A0  B0
1  A1  B1
0  A0  B0
1  A1  B1

In [52]:
# Case 2: Catching duplications as errors
try:
    pd.concat([x, y], verify_integrity=True)   # try-except문으로 error handling

except ValueError as e:
    print("ValueError: ", e)   # 에러 발생시 except 부분 실행

ValueError:  Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [56]:
# Case 3: Ignore the index: 
pd.concat([x,y], ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A0  B0
3  A1  B1

In [58]:
"""
    concat(): join options
"""

x = make_df('ABC', [1,2])
y = make_df('BCD', [3,4])

print(x); print(y)

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [60]:
# outer join -> union
pd.concat([x,y], join='outer')

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [61]:
# inner join -> intersection
pd.concat([x,y], join='inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [73]:
"""
    Join operations
"""

# Prepare the two DataFrame objects
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})

print(df1)
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [69]:
# One-to-one joins
df3 = pd.merge(df1, df2)
print(df3)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [70]:
# Many-to-one joins
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                   'supervisor': ['Carly', 'Guido', 'Steve']})

print(df3)
print(df4)

pd.merge(df3, df4)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [71]:
# Many-to-many joins
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                             'Engineering', 'Engineering',
                             'HR', 'HR'],
                   'skills': ['math', 'spreadsheets', 'coding',
                             'linux', 'spreadsheets', 'organization']})

print(df1)
print(df5)

pd.merge(df1, df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [74]:
"""
    Specifying the merge Key
"""

# 'on' argument: use a common column as merge key
print(df1); print(df2, '\n')

df1['age'] = pd.Series([20, 42, 37, 35])
df2['age'] = pd.Series([37, 20, 42, 35])

print(df1); print(df2, '\n')

print(pd.merge(df1, df2, on = 'age'), '\n')

pd.merge(df1, df2, on = ['employee','age'])

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  age
0      Bob   Accounting   20
1     Jake  Engineering   42
2     Lisa  Engineering   37
3      Sue           HR   35
  employee  hire_date  age
0     Lisa       2004   37
1      Bob       2008   20
2     Jake       2012   42
3      Sue       2014   35

  employee_x        group  age employee_y  hire_date
0        Bob   Accounting   20        Bob       2008
1       Jake  Engineering   42       Jake       2012
2       Lisa  Engineering   37       Lisa       2004
3        Sue           HR   35        Sue       2014

  employee        group  age  hire_date
0      Bob   Accounting   20       2008
1     Jake  Engineering   42       2012
2     Lisa  Engineering   37       2004
3      Sue           HR   35       2014

In [75]:
# 'left_on' and 'right_on' arguments:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'salary': [70000, 80000, 120000, 90000]})

print(df1); print(df3, '\n')

pd.merge(df1, df3, left_on='employee', right_on='name')

  employee        group  age
0      Bob   Accounting   20
1     Jake  Engineering   42
2     Lisa  Engineering   37
3      Sue           HR   35
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

  employee        group  age  name  salary
0      Bob   Accounting   20   Bob   70000
1     Jake  Engineering   42  Jake   80000
2     Lisa  Engineering   37  Lisa  120000
3      Sue           HR   35   Sue   90000

In [76]:
# 'left_index' and 'right_index' arguments
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

print(df1a); print(df2a, '\n')

pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  age
employee
Bob        Accounting   20
Jake      Engineering   42
Lisa      Engineering   37
Sue                HR   35
          hire_date  age
employee
Lisa           2004   37
Bob            2008   20
Jake           2012   42
Sue            2014   35

                group  age_x  hire_date  age_y
employee
Bob        Accounting     20       2008     20
Jake      Engineering     42       2012     42
Lisa      Engineering     37       2004     37
Sue                HR     35       2014     35